{
  "information": {
    "Creature parts: Brain": {
      "0": "A brain is HIGHLY important for the organic body, because of it's nature and the use. The brain has neurons that each run certain actions of a condition is met. The brain also commands certain muscle to stretch, or certain organs to do things. This was an example, of course.\n\nThe brain may look very weird at first, but the shape defines how it works. The brain (like all organs) also needs blood to work. But if too much blood is put, this organ may leak/swell, or this organ might not be able to be used.\n\nThe organ's stats are listed below.\n\nName: Brain\nIs an organ: Yes\nUse: Working like a mind, controlling certain parts, etc.\nIs sensitive: VERY sensitive\nNeeds: Blood, oxygen, nutrients\n\nFun facts: Alcohol can affect the neurons and decisions for this brain, making the brain badly modify-able.\n\nA brain looks like:\n",
      "1": "[https://apanentgithub2024.github.io/wikipedia/img/brain.png]",
      "2": "Brain from vecteezy.com by facultycinema (2023)\n\nExtras\nThe brain also has limitations. The brain can't control ALL organs of the body, which is important, because you don't want to manually keep your heart beating using your energy or thinking.\n\nNicotine is also bad for the brain, because nicotine is an addictive chemical. This gives the brain a bad habit to try to do things involving this chemical, for example. The examples are:\n\n- Smoking\n- Taking drugs\n\nDrugs are VERY UNHEALTHY for the brain, which means you should NOT take any drugs that affect your thinking.\n\nFluorine also affects the brain, because the chemical can most likely cause the brain to have it's IQ score decreased significantly. This happens because this chemical can:\n\n- Stop some neurons from executing when the neurons are working\n- Dysfunctioning other neurons (e.g. permanently disabling them)\n- Limit memory\n- Break down neurons (this isn't exactly what can also happen)\n\nA skull, or other bone can protect against any of these chemicals so the brain can work in a mentally normal way.\n\nThe brain can also adapt, and learn to do tasks by being trained on. Effects when born, like autism, can make it so the brain can learn even more from other tasks and what to do.\n\nWhat's unhealthy is that the brain can even learn brom bad examples and bad ways to communicate, which is why children should watch educational shows or shows using manners.\n\nI hope this article impresses you!"
    },
    "Creature parts: Lungs": {
      "0": "The lungs are used to store in air or oxygen. They may look like just a pipe attached with two bags, but this organ is actually useful. This organ can be used to transmit air or oxygen to another organ if needed.\n\nLungs are very sensitive to chemicals or fogs (like smoke), because of the thin skin for the lungs. So if too much smoke is in the lungs, the smoke can even tear the skin apart, or cause the organ swelling.\n\nName: Lungs\nIs an organ: Yes (because the lungs are used for other things) and no (because this doesn't use blood)\nUse: Storing oxygen, storing air\nIs sensitive: Sensitive\nNeeds: Nutrients, vitamins\n\nLungs look like:",
      "1": "[https://apanentgithub2024.github.io/wikipedia/img/lungs.png]",
      "2": "Lungs from easyimages.net. Author is unknown.\n\nExtras\nThe lungs can even be affected by fluorine/fluoride, because the fluorine/fluoride can cause lung cancer when put inside lungs.\n\nLungs look like a small tube that is facing above with two bag-like parts with an indent on each lung. The lungs are normally red/persimmon/pink.\n\nLungs with lung cancer look like the one provided above, but with a darker color.\n\nEach lung is made to store in air and oxygen, assumably for keeping in breath.\n\nWhy you may see people panting is because they're not getting enough oxygen for the lungs."
    },
    "Science chemicals: Hydrogen": {
      "0": "Hydrogen is a science chemical that usually makes things float. This does not make liquid float. However, this chemical can irritate the skin when you are in this.\n\nHydrogen normally looks like yellow gas, which is hard to see sometimes.\n\nThis chemical is also flammable, and this chemical can also cause explosions. However, there is very little chance for this to explode. This is also HIGHLY reactive to other chemicals, so be careful when experimenting with this chemical!"
    },
    "Science chemicals: Fluoride/Fluorine": {
      "0": "Fluoride/Fluorine is a chemical that usually helps strengthen your teeth, which is why dentists put Fluoride/Fluorine on your teeth when your teeth is slightly weaker.\n\nHowever, this chemical can cause a lot of problems with organs, like mentioned at the 'Creature parts: Brain' and the 'Creature parts: Lungs' article. So, when you have these organs and you are making your own creature with those, make sure to put this chemical at the appropriate place!\n\nProblems\n1. This chemical can cause tooth decay when you have too much of this chemical on your teeth. This causes your teeth to look brown or yellow.\n2. This chemical causes lung cancer when this reaches to the lungs, making the lungs no longer healthy.\n3. This chemical can even cause significant IQ decrease when this chemical reaches to the brain.\n4. This chemical also weakens the bones and the skeletal body, because this chemical can fight off against calcium, or because this chemical is acidic.\n\nThis chemical is also highly reactive. This chemical has no appearance, and no smell.\n\nFluorine is also considered to be one of the most electronic chemicals to exist."
    },
    "Science chemicals: Chlorine": {
      "0": "Chlorine is a chemical that usually helps fight off bacteria. This is found in pools. However, this chemical is very dangerous to experiment with! This chemical is flammable, and this chemical MIGHT be combustible.\n\nThis chemical can also cause lung cancer. This chemical is also very unhealthy for the human body.\n\nI know this article is too short, I tried ;("
    },
    "Science chemicals: Calcium": {
      "0": "Calcium is a chemical that usually hardens objects. This does not harden liquid, and this also travels with the liquid.\n\nCalcium dissolves when this meets with any acidic chemicals. This most likely found in bone. Vinegar is acidic to this chemical, which is why calcium dissolves with vinegar.\n\nCalcium is also found in eggshells.\n\nCalcium also makes some objects appear slightly more lighter (in color), giving this the fact that this barely has any appearance. Calcium is also found in milk.\n\nCalcium has no smell.\n\nI know this article is too short, I tried ;("
    },
    "Science chemicals: Sodium": {
      "0": "Sodium is a chemical that usually helps dry other objects, which is why you may feel thirsty after this chemical gets to your throat.\n\nSodium is also found in salt.\n\nThis is also found in liquid blood. However, if you have too much of this chemical, this chemical can possibly\n1. Cause bloating, because sodium attracts water molecules or fluid.\n2. Increase blood pressure, which is something you don't want to happen.\n3. Degrade your chances of getting a good night's rest.\n4. Increase a risk of getting a heart disease.\n5. Increase a risk of getting a kidney/stroke disease.\n\n This is important, because the human body needs a small amount of sodium to work.\n\nSodium is also the same thing as salt. Salt is also used to make the food have a tasteless slightly cold and sweet feeling, which helps enhance the hot food."
    },
    "Liquids: Oil": {
      "0": "Oil is a liquid that is only temporary. Oil has a black color.\n\nHOWEVER, this liquid is highly bad for the environment, because\n1. Oil causes land degrading, meaning the land might be limited more if this oil gets to the land (e.g. less species, less plants, etc).\n2. Oil can even harm most creatures when most creatures are near this.\n\nSo, it's recommended to use electric-powered gadgets instead of gadgets that run on oil.\n\nOil is also temporary, meaning this doesn't last very long (globally).\n\nOil is very combustible, and this also causes fire.\n\nOil is very harmful for plants, like trees."
    },
    "Liquids: Water": {
      "0": "Water is a liquid that has no taste, no smell, and no color. Water is very healthy for creatures, because this doesn't have any bad chemicals in it.\n\nWater can also be a bit sticky when one drop is touching an object, so water molecules can merge into other water molecules.\n\nWater is only healthy when it is fresh. Water is found in many locations, like a pond, a lake, a waterfall, a water park, etc."
    },
    "History: Michel Lotito": {
      "0": "Michel Lotito, also known as 'Monsieur Mangetout', was a man that was born in France. He was known for consuming unedible objects. The reason for this unbelivable goal was because of a medical condition, known as 'pica'. Pica was a condition that meant that a person had an additional appetite for eating unedible objects.\n\nThis means that if you were dared to eat a short stick of chalk, you can easily do that dare anyway! That would probably impress your own school and contribute (add more) to your popularity.\n\nUnfortunately, Michel Lotito died in June 25th, 2007 at the age of 57. This meant he was born in 1950 (approximate date). The exact date is June 15, 1950.\nThis cause was due to \"natural causes\".\n\nFun fact: He even ate an entire airplane in 1978-1980! He did this by consuming each metal part individually every one or two days, which helps make this process easier."
    },
    "Two hated programming languages": {
      "0": "1. JavaScript: JavaScript is a programming language that is a big success for website usage, but has some issues that need to be mentioned before use.\n- Inefficient Arithmetic Operations: JavaScript had four arithmetic operations that would usually (for an example) add the left value to the right value, or append the right value into the left value. So, this means that:\n-- 1 + \"\" is equal to \"1\"\n-- \"Hello\" + \" there\" is equal to \"Hello there\"\nand\n-- {} + [] is equal to 0\n\"Wait, what? What is going on with {} + []?\" is what you probably might be wondering in your head. This is because {} is interpreted as an empty block instead of an Object, and the rest of \"+ []\" is interpreted, which results in 0.\n\"What happens when I add [] and [] together?\"\nThis is going to be more confusing... this gets you a blank string.\nThis is why the arithmetic operations are buggy, or not implemented very good. It still works with 1 + 1, which does get you 2.\n- Performance: Sometimes, JavaScript's compiler may add some additional overhead to the machine code compilation, which can bring up some performance concerns and the need to switch to other high-performance programming languages.\n- Early implementations: There was an unfortunate incident where it was easier to accidently define global variables in the code, which also added some frustration.\n- Equality sign: Programmers also didn't like how the syntax for the == sign was implemented, which was because of how it was behaving in their code. == usually performs an operation where it would convert both left and right operands into the approximate value for these. This means that \"0\" is equal to 0, but \"0\" isn't strictly equal to 0.\n- NaN: NaN is a value clearly meant for when a certain arithmetic operation fails, but there is one thing that is super confusing: NaN is not equal to itself. Why? Just... why?\n- Own Regex Syntax: JavaScript is also konwn for having its own regex syntax, which also adds some confusion to the programming process. This is also difficult to learn to developers who are used to the Perl and/or Python regex syntax.\n- Escaped letters: Sometimes, programmers who expect \s to be treated as a literal letter 's' may be confused with why this detects whitespace. This usually confuses programmers who are not interested in reading the documentation, and how to use these whitespace letters.\n- Laziness: Very few of JavaScript's operations may be another shortcut for another operation. So for an example, the function String actually returns `n.toString()`, where :n is the value called into the function. This can introduce unexpected behavior where the `toString` function is overriding the traditional function itself.\nALright... now let's move onto Python.\n2. Python: Python is a very powerful programming language that was known for it's modules that are powerful. However, it's own issues were causing frustration, too.\n- Sensitivity: Python usually uses a colon then an indentation for all of the scopes. In vocabulary terms, the indent is basically a tab (which is roughly four spaces). But if even one tab was added or removed, this would result in an error. This is because in many compilers, most whitespace is ignored.\n- Need for modules: Sometimes when you exoect a function to be available for delaying the code for a certain amount of time, you instead have to import the `time` module into the code snippet, then call the `time.sleep` function. This might not be hated very much, but this can be a bit frustrating.\n- Performance: Python is very slow in a lot of interpreters, and Python is an interpreted language, which can have more complexity, but does not have the best performance for execution.\n- No keywords for definition: This is not hated very much, but this does introduce some frustration. Some programmers expect a keyword for a variable to be defined at the start of the line, but this isn't always the case. This means instead of something like `def v = 0`, programmers have to use `v = 0` instead.\nI hope this has covered many reasons of why these two programming languages were hated on."
    }
  },
  "pages": ["Creature parts: Brain", "Creature parts: Lungs", "Science chemicals: Fluoride/Fluorine", "Science chemicals: Hydrogen", "Science chemicals: Chlorine", "Science chemicals: Calcium", "Science chemicals: Sodium", "Liquids: Oil", "Liquids: Water", "History: Michel Lotito", "Two hated programming languages"]
}
