{
  "information": {
    "Summary of GoAnimate and Vyond": {
      "0": "GoAnimate is the fundamental software that originally helped users learn to create animations by using a limited amount of preanimated emotes, states for certain props, stock sound effects, and predesigned props, without the pressure of having to animate everything from scratch. GoAnimate was originally introduced in 2007, and has been rebranded in 2018 (11 years later before rebranding). GoAnimate also has been used in schools for teaching students how to animate using a not too complex UI. GoAnimate has been powered by the Adobe Flash 64-bit Player, which is now deprecated since Adobe Flash's \"End Of Life\" (Adobe Flash has now been removed from many browsers) that happened in December 31st, 2020 (according to the Gregorian Calendar). GoAnimate's original URL of their platform was \"https://goanimate.com\", which now automatically redirects anyone who visits it to \"https://vyond.com\". The original creator of GoAnimate was Cary Huang, who first introduced the GoAnimate software, and the platform. GoAnimate usually had four possible watermarks placed on the bottom-left of each video made with GoAnimate, such as just the GoAnimate logo, \"GoAnimate - Make Your Own\" (the dash being a newline), \"GoAnimate - For Schools\" (the dash being a newline), and \"GoAnimate Free - Trial\" (the dash being a newline. this watermark has a white color, and is centered to the middle of the video). The four possible watermarks are for letting the viewer know which software was used to create the animations.",
      "1": "",
      "2": "Vyond is the rebrand of GoAnimate, which was because of the unprofessional feel of GoAnimate (GoAnimate was easy to come up with as a name, and is too obvious that it is an animation software), and because of the absurdity of many GoAnimate videos users have created (the developers didn't want to have their platform known for unoriginality so they rebranded it to attempt to have a more business-like approach), which now requires the user to operate on a trial that requires the user to pay a specific amount of money every month until the user quits the trial. Vyond has now been exported into HTML5, and their platform is now located at the URL \"https://vyond.com\". Before the user gets charged a fee for every month, there is a free trial that would last a week (seven days) before the user encounters a fee-based trial. The most notable style for Vyond animations, is Business Friendly, which features 200+ emotes for any character, and is meant for business-oriented animations."
    }
  },
  "pages": ["Summary of GoAnimate and Vyond"]
}
