{
  "information": {
    "Creature parts: brain": {
      "0": "A brain is HIGHLY important for the organic body, because of it's nature and the use. The brain has neurons that each run certain actions of a condition is met. The brain also commands certain muscle to stretch, or certain organs to do things. This was an example, of course.\n\nThe brain may look very weird at first, but the shape defines how it works. The brain (like all organs) also needs blood to work. But if too much blood is put, this organ may leak/swell, or this organ might not be able to be used.\n\nThe organ's stats are listed below.\n\nName: Brain\nIs an organ: Yes\nUse: Working like a mind, controlling certain parts, etc.\nIs sensitive: VERY sensitive\nNeeds: Blood, oxygen, nutrients\n\nFun facts: Alcohol can affect the neurons and decisions for this brain, making the brain badly modify-able.\n\nA brain looks like:\n",
      "1": "[https://apanentgithub2024.github.io/wikipedia/img/brain.png]",
      "2": "Brain from vecteezy.com by facultycinema (2023)\n\nExtras\nThe brain also has limitations. The brain can't control ALL organs of the body, which is important, because you don't want to manually keep your heart beating using your energy or thinking.\n\nNicotine is also bad for the brain, because nicotine is an addictive chemical. This gives the brain a bad habit to try to do things involving this chemical, for example. The examples are:\n\n- Smoking\n- Taking drugs\n\nDrugs are VERY UNHEALTHY for the brain, which means you should NOT take any drugs that affect your thinking.\n\nFluorine also affects the brain, because the chemical can most likely cause the brain to have it's IQ score decreased significantly. This happens because this chemical can:\n\n- Stop some neurons from executing when the neurons are working\n- Dysfunctioning other neurons (e.g. permanently disabling them)\n- Limit memory\n- Break down neurons (this isn't exactly what can also happen)\n\nA skull, or other bone can protect against any of these chemicals so the brain can work in a mentally normal way.\n\nThe brain can also adapt, and learn to do tasks by being trained on. Effects when born, like autism, can make it so the brain can learn even more from other tasks and what to do.\n\nWhat's unhealthy is that the brain can even learn brom bad examples and bad ways to communicate, which is why children should watch educational shows or shows using manners.\n\nI hope this article impresses you!"
    },
    "Creature parts: lungs": {
      "0": "The lungs are used to store in air or oxygen. They may look like just a pipe attached with two bags, but this organ is actually useful. This organ can be used to transmit air or oxygen to another organ if needed.\n\nLungs are very sensitive to chemicals or fogs (like smoke), because of the thin skin for the lungs. So if too much smoke is in the lungs, the smoke can even tear the skin apart, or cause the organ swelling.\n\nName: Lungs\nIs an organ: Yes (because the lungs are used for other things) and no (because this doesn't use blood)\nUse: Storing oxygen, storing air\nIs sensitive: Sensitive\nNeeds: Nutrients, vitamins\n\nLungs look like:",
      "1": "[https://apanentgithub2024.github.io/wikipedia/img/lungs.png]",
      "2": "Lungs from easyimages.net. Author is unknown.\n\nExtras\nThe lungs can even be affected by fluorine/fluoride, because the fluorine/fluoride can cause lung cancer when put inside lungs.\n\nLungs look like a small tube that is facing above with two bag-like parts with an indent on each lung. The lungs are normally red/persimmon/pink.\n\nLungs with lung cancer look like the one provided above, but with a darker color.\n\nEach lung is made to store in air and oxygen, assumably for keeping in breath.\n\nWhy you may see people panting is because they're not getting enough oxygen for the lungs."
    }
  },
  "pages": ["Creature parts: brain", "Creature parts: lungs"]
}
